//  Повторение

// const color = ['red', 'blue', 'green', 'yellow', 'violet']



// for(let colour in color) {
//     console.log(Color is - ${color});
    
// }

// const Калкульятор = (a, b, s) => {
//     switch(s){
//         case '+': return a+b;
//         case '-': return a-b;
//         case '*': return a*b;
//         case '/': return a/b;

//         default: return 'Неправильный ввод.'
//     }
// }
// console.log(Калкульятор(4, 5, '1'));
// console.log(Калкульятор(4, 5, '-'));
// console.log(Калкульятор(4, 5, '*'));
// console.log(Калкульятор(4, 5, '/'));


// const Персона = {
//     Фамилия : "Степанов",
//     Имя : "Артём",
//     Возраст : "24",
//     Хобби : {
//         Спорт : "Футбол",
//         Музыка : "Рок"
//     }
// }


// a = prompt("Как вас зовут?")
// b = prompt("Ваша фамилия?")
// c = +prompt("Какого вы года рождения?")

// d = alert(Вы ${b} ${a}, и вам ${2025 - c} лет.)

let Сумма = 0

function Магазин(){
    a = prompt("Добро пожаловать в магазин! Будете брать пиво?")
    b = prompt("Будете брать водку?")
    c = prompt("Будете брать вино?")
    d = prompt("Будете брать хлеб?")
    e = prompt("Будете брать готовое оливье?")

    if (a === "да"){
        Сумма += 15000
    } else if(b === "да"){
        Сумма += 35000
    } else if(c === "да"){
        Сумма += 30000
    } else if(d === "да"){
        Сумма += 2500
    } else if(e === "да"){
        Сумма += 25000
    } 
    alert(`Вы потратили ${Сумма} сум!`)
}

Магазин()